Tekla Open API Reference for Tekla Structures 2025
WpfMaterialCatalog Methods
The WpfMaterialCatalog type exposes the following members.
Methods
Name | Description
InitializeComponent
 InitializeComponent
Top
See Also
Reference
WpfMaterialCatalog Class
Tekla.Structures.Dialog.UIControls Namespace